[
  {
    "title": "Elimination Game",
    "year": "2014",
    "released": "04 Dec 2014",
    "runtime": "90 min",
    "genre": "Action",
    "director": "Jon Hewitt",
    "actors": "Dominic Purcell, Viva Bianca, Robert Taylor, Belinda McClory",
    "plot": "In the wake of a shocking civilian massacre in a foreign war zone, disgraced Navy SEAL Rick Tyler is sentenced to rot in a maximum security military prison until he is offered the opportunity to put his life on the line to win his freedom. A one-man force of nature, Tyler will have to take-on and take-down some of the world's most ruthless killers in some of the world's most brutal locations to win the game, obtain his freedom and find out why he was set up. The question is, can he accomplish all of this before Game On is Game Over?",
    "language": "English",
    "country": "Australia",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "3.6/10"
      }
    ]
  },
  {
    "title": "Game of Thrones",
    "year": "2012",
    "released": "15 May 2012",
    "runtime": "54 min",
    "genre": "Fantasy",
    "director": "Cédric Lagarrigue",
    "actors": "Emma Bryant, James Cosmo, Conleth Hill, Colin Solman",
    "plot": "Enter the gritty and medieval fantasy world of Westeros as players will forge alliances and wage battles as they play a pivotal role in the ongoing war for power of the Seven Kingdoms.",
    "language": "English",
    "country": "France",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.1/10"
      }
    ]
  },
  {
    "title": "Batman & Robin",
    "year": "1998",
    "released": "31 Jul 1998",
    "runtime": "98  min",
    "genre": "Animation, Adventure, Action",
    "director": "N/A",
    "actors": "James Avery, Scott Cleverdon, Rickey D'Shon Collins, Keith David",
    "plot": "N/A",
    "language": "French",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "5.8/10"
      }
    ]
  },
  {
    "title": "Superman vs. Batman: When Heroes Collide",
    "year": "2013",
    "released": "29 Jan 2013",
    "runtime": "10 min",
    "genre": "Short",
    "director": "Alexander Gray, Jeff Maynard",
    "actors": "Mike Carlin, Bob Goodman, Grant Morrison, Denny O'Neil",
    "plot": "N/A",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.8/10"
      }
    ]
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "year": "2001",
    "released": "16 Nov 2001",
    "runtime": "152 min",
    "genre": "Adventure, Family, Fantasy",
    "director": "Chris Columbus",
    "actors": "Richard Harris, Maggie Smith, Robbie Coltrane, Saunders Triplets",
    "plot": "This is the tale of Harry Potter, an ordinary 11-year-old boy serving as a sort of slave for his aunt and uncle who learns that he is actually a wizard and has been invited to attend the Hogwarts School for Witchcraft and Wizardry. Harry is snatched away from his mundane existence by Hagrid, the grounds keeper for Hogwarts, and quickly thrown into a world completely foreign to both him and the viewer. Famous for an incident that happened at his birth, Harry makes friends easily at his new school. He soon finds, however, that the wizarding world is far more dangerous for him than he would have imagined, and he quickly learns that not all wizards are ones to be trusted.",
    "language": "English",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.6/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "81%"
      },
      {
        "source": "Metacritic",
        "value": "64/100"
      }
    ]
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "year": "2002",
    "released": "15 Nov 2002",
    "runtime": "161 min",
    "genre": "Adventure, Family, Fantasy, Mystery",
    "director": "Chris Columbus",
    "actors": "Daniel Radcliffe, Rupert Grint, Emma Watson, Richard Griffiths",
    "plot": "Forced to spend his summer holidays with his muggle relations, Harry Potter gets a real shock when he gets a surprise visitor: Dobby the house-elf, who warns Harry Potter against returning to Hogwarts, for terrible things are going to happen. Harry decides to ignore Dobby's warning and continues with his pre-arranged schedule. But at Hogwarts, strange and terrible things are indeed happening: Harry is suddenly hearing mysterious voices from inside the walls, muggle-born students are being attacked, and a message scrawled on the wall in blood puts everyone on his/her guard - \"The Chamber Of Secrets Has Been Opened. Enemies Of The Heir, Beware\" .",
    "language": "English",
    "country": "UK, USA, Germany",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.4/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "82%"
      },
      {
        "source": "Metacritic",
        "value": "63/100"
      }
    ]
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "year": "2004",
    "released": "04 Jun 2004",
    "runtime": "142 min",
    "genre": "Adventure, Family, Fantasy, Mystery",
    "director": "Alfonso Cuarón",
    "actors": "Daniel Radcliffe, Richard Griffiths, Pam Ferris, Fiona Shaw",
    "plot": "Harry Potter is having a tough time with his relatives (yet again). He runs away after using magic to inflate Uncle Vernon's sister Marge who was being offensive towards Harry's parents. Initially scared for using magic outside the school, he is pleasantly surprised that he won't be penalized after all. However, he soon learns that a dangerous criminal and Voldemort's trusted aide Sirius Black has escaped from the Azkaban prison and wants to kill Harry to avenge the Dark Lord. To worsen the conditions for Harry, vile creatures called Dementors are appointed to guard the school gates and inexplicably happen to have the most horrible effect on him. Little does Harry know that by the end of this year, many holes in his past (whatever he knows of it) will be filled up and he will have a clearer vision of what the future has in store...",
    "language": "English",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.9/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "90%"
      },
      {
        "source": "Metacritic",
        "value": "82/100"
      }
    ]
  },
  {
    "title": "Harry Potter and the Goblet of Fire",
    "year": "2005",
    "released": "18 Nov 2005",
    "runtime": "157 min",
    "genre": "Adventure, Family, Fantasy, Mystery",
    "director": "Mike Newell",
    "actors": "Eric Sykes, Timothy Spall, David Tennant, Daniel Radcliffe",
    "plot": "Harry's fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final but after the match is over, people dressed like Lord Voldemort's 'Death Eaters' set a fire to all the visitors' tents, coupled with the appearance of Voldemort's symbol, the 'Dark Mark' in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting 'The Triwizard Tournament', a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons and Durmstrang. The contestants have to be above the age of 17, and are chosen by a magical object called Goblet of Fire. On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.",
    "language": "English, French",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.7/10"
      },
      {
        "source": "Metacritic",
        "value": "81/100"
      }
    ]
  },
  {
    "title": "Harry Potter and the Order of the Phoenix",
    "year": "2007",
    "released": "11 Jul 2007",
    "runtime": "138 min",
    "genre": "Adventure, Family, Fantasy, Mystery",
    "director": "David Yates",
    "actors": "Daniel Radcliffe, Harry Melling, Jason Boyd, Richard Macklin",
    "plot": "After a lonely summer on Privet Drive, Harry returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore that Voldemort is really back. The ministry had decided to step in by appointing a new Defence Against the Dark Arts teacher that proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang. To top it off are dreams that Harry can't explain, and a mystery behind something Voldemort is searching for. With these many things Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.",
    "language": "English",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "77%"
      },
      {
        "source": "Metacritic",
        "value": "71/100"
      }
    ]
  },
  {
    "title": "Iron Man",
    "year": "2008",
    "released": "02 May 2008",
    "runtime": "126 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Jon Favreau",
    "actors": "Robert Downey Jr., Terrence Howard, Jeff Bridges, Gwyneth Paltrow",
    "plot": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.",
    "language": "English, Persian, Urdu, Arabic, Hungarian",
    "country": "USA, Canada",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.9/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "93%"
      },
      {
        "source": "Metacritic",
        "value": "79/100"
      }
    ]
  },
  {
    "title": "Spider-Man",
    "year": "2002",
    "released": "03 May 2002",
    "runtime": "121 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Sam Raimi",
    "actors": "Tobey Maguire, Willem Dafoe, Kirsten Dunst, James Franco",
    "plot": "Based on Marvel Comics' superhero character, this is a story of Peter Parker who is a nerdy high-schooler. He was orphaned as a child, bullied by jocks, and can't confess his crush for his stunning neighborhood girl Mary Jane Watson. To say his life is \"miserable\" is an understatement. But one day while on an excursion to a laboratory a runaway radioactive spider bites him... and his life changes in a way no one could have imagined. Peter acquires a muscle-bound physique, clear vision, ability to cling to surfaces and crawl over walls, shooting webs from his wrist ... but the fun isn't going to last. An eccentric millionaire Norman Osborn administers a performance enhancing drug on himself and his maniacal alter ego Green Goblin emerges. Now Peter Parker has to become Spider-Man and take Green Goblin to the task... or else Goblin will kill him. They come face to face and the war begins in which only one of them will survive at the end.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.3/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "90%"
      },
      {
        "source": "Metacritic",
        "value": "73/100"
      }
    ]
  },
  {
    "title": "Ip Man",
    "year": "2008",
    "released": "12 Dec 2008",
    "runtime": "106 min",
    "genre": "Action, Biography, Drama, Sport",
    "director": "Wilson Yip",
    "actors": "Donnie Yen, Simon Yam, Lynn Xiong, Hiroyuki Ikeuchi",
    "plot": "In 1935 in Foshan, south China, there are martial arts schools on every street corner. Ip Man is the undisputed martial arts champion, yet he has not devoted himself to teaching. Despite this, it seems that all the kung fu masters of the city are eager to fight him to improve their reputation.",
    "language": "Cantonese, Mandarin, Japanese",
    "country": "Hong Kong, China",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.0/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "85%"
      },
      {
        "source": "Metacritic",
        "value": "59/100"
      }
    ]
  },
  {
    "title": "The Fifth Estate",
    "year": "2013",
    "released": "18 Oct 2013",
    "runtime": "128 min",
    "genre": "Biography, Drama, Thriller",
    "director": "Bill Condon",
    "actors": "Peter Capaldi, David Thewlis, Anatole Taubman, Alexander Beyer",
    "plot": "The story begins as WikiLeaks founder Julian Assange (Benedict Cumberbatch) and his colleague Daniel Domscheit-Berg (Daniel Brühl) team up to become underground watchdogs of the privileged and powerful. On a shoestring, they create a platform that allows whistle-blowers to anonymously leak covert data, shining a light on the dark recesses of government secrets and corporate crimes. Soon, they are breaking more hard news than the world's most legendary media organizations combined. But when Assange and Berg gain access to the biggest trove of confidential intelligence documents in U.S. history, they battle each other and a defining question of our time: what are the costs of keeping secrets in a free society-and what are the costs of exposing them?",
    "language": "English, Icelandic, Swahili, Arabic",
    "country": "USA, India, Belgium",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.2/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "36%"
      },
      {
        "source": "Metacritic",
        "value": "49/100"
      }
    ]
  },
  {
    "title": "The Fifth Element",
    "year": "1997",
    "released": "09 May 1997",
    "runtime": "126 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Luc Besson",
    "actors": "Bruce Willis, Gary Oldman, Ian Holm, Milla Jovovich",
    "plot": "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando Major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones.",
    "language": "English, Swedish, German, Arabic, Egyptian (Ancient)",
    "country": "France",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.7/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "71%"
      },
      {
        "source": "Metacritic",
        "value": "52/100"
      }
    ]
  },
  {
    "title": "Sherlock",
    "year": "2010",
    "released": "24 Oct 2010",
    "runtime": "88 min",
    "genre": "Crime, Drama, Mystery, Thriller",
    "director": "Mark Gatiss",
    "actors": "Benedict Cumberbatch, Martin Freeman, Una Stubbs, Rupert Graves",
    "plot": "In this modernized version of the Conan Doyle characters, using his detective plots, Sherlock Holmes lives in early 21st century London and acts more cocky towards Scotland Yard's detective inspector Lestrade because he's actually less confident. Doctor Watson is now a fairly young veteran of the Afghan war, less adoring and more active.",
    "language": "English",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "9.2/10"
      }
    ]
  },
  {
    "title": "Sherlock Holmes: A Game of Shadows",
    "year": "2011",
    "released": "16 Dec 2011",
    "runtime": "129 min",
    "genre": "Action, Adventure, Crime, Mystery, Thriller",
    "director": "Guy Ritchie",
    "actors": "Robert Downey Jr., Jude Law, Noomi Rapace, Rachel McAdams",
    "plot": "Sherlock Holmes (Robert Downey Jr.) and his longtime trusted associate, Doctor Watson (Jude Law), take on their arch-nemesis, Professor Moriarty (Jared Harris), with the help of Holmes' older brother Mycroft Holmes (Stephen Fry) and a gypsy named Simza (Noomi Rapace).",
    "language": "English, French, Italian, German, Romany",
    "country": "USA, UK",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "60%"
      },
      {
        "source": "Metacritic",
        "value": "48/100"
      }
    ]
  },
  {
    "title": "The Lord of the Rings: The Return of the King",
    "year": "2003",
    "released": "17 Dec 2003",
    "runtime": "201 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Noel Appleby, Ali Astin, Sean Astin, David Aston",
    "plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits: Frodo and Sam reach Mordor in their quest to destroy the \"one ring\", while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
    "language": "English, Quenya, Old English, Sindarin",
    "country": "New Zealand, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.9/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "93%"
      },
      {
        "source": "Metacritic",
        "value": "94/100"
      }
    ]
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "year": "2001",
    "released": "19 Dec 2001",
    "runtime": "178 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Alan Howard, Noel Appleby, Sean Astin, Sala Baker",
    "plot": "An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!",
    "language": "English, Sindarin",
    "country": "New Zealand, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.8/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "91%"
      },
      {
        "source": "Metacritic",
        "value": "92/100"
      }
    ]
  },
  {
    "title": "The Lord of the Rings: The Two Towers",
    "year": "2002",
    "released": "18 Dec 2002",
    "runtime": "179 min",
    "genre": "Adventure, Drama, Fantasy",
    "director": "Peter Jackson",
    "actors": "Bruce Allpress, Sean Astin, John Bach, Sala Baker",
    "plot": "While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.",
    "language": "English, Sindarin, Old English",
    "country": "New Zealand, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.7/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "95%"
      },
      {
        "source": "Metacritic",
        "value": "87/100"
      }
    ]
  },
  {
    "title": "The Avengers",
    "year": "2012",
    "released": "04 May 2012",
    "runtime": "143 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Joss Whedon",
    "actors": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth",
    "plot": "Nick Fury is the director of S.H.I.E.L.D., an international peace-keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster.",
    "language": "English, Russian, Hindi",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.1/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "92%"
      },
      {
        "source": "Metacritic",
        "value": "69/100"
      }
    ]
  },
  {
    "title": "Avengers: Age of Ultron",
    "year": "2015",
    "released": "01 May 2015",
    "runtime": "141 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Joss Whedon",
    "actors": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans",
    "plot": "Tony Stark creates the Ultron Program to protect the world, but when the peacekeeping program becomes hostile, The Avengers go into action to try and defeat a virtually impossible enemy together. Earth's mightiest heroes must come together once again to protect the world from global extinction.",
    "language": "English, Korean",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.4/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "75%"
      },
      {
        "source": "Metacritic",
        "value": "66/100"
      }
    ]
  },
  {
    "title": "Avengers: Infinity War",
    "year": "2018",
    "released": "27 Apr 2018",
    "runtime": "149 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Anthony Russo, Joe Russo",
    "actors": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans",
    "plot": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "85%"
      },
      {
        "source": "Metacritic",
        "value": "68/100"
      }
    ]
  },
  {
    "title": "Captain America: The First Avenger",
    "year": "2011",
    "released": "22 Jul 2011",
    "runtime": "124 min",
    "genre": "Action, Adventure, Sci-Fi",
    "director": "Joe Johnston",
    "actors": "Chris Evans, Hayley Atwell, Sebastian Stan, Tommy Lee Jones",
    "plot": "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential. When Dr. Erskine is then immediately assassinated by an agent of Nazi Germany's secret HYDRA research department (headed by Johann Schmidt, a.k.a. the Red Skull), Rogers is left as a unique man who is initially misused as a propaganda mascot; however, when his comrades need him, Rogers goes on a successful adventure that truly makes him Captain America, and his war against Schmidt begins.",
    "language": "English, Norwegian, French",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.9/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "80%"
      },
      {
        "source": "Metacritic",
        "value": "66/100"
      }
    ]
  },
  {
    "title": "Green Book",
    "year": "2018",
    "released": "16 Nov 2018",
    "runtime": "130 min",
    "genre": "Biography, Comedy, Drama, Music",
    "director": "Peter Farrelly",
    "actors": "Viggo Mortensen, Mahershala Ali, Linda Cardellini, Sebastian Maniscalco",
    "plot": "A working-class Italian-American bouncer becomes the driver of an African-American classical pianist on a tour of venues through the 1960s American South.",
    "language": "English, Italian, Russian, German",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.3/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "78%"
      },
      {
        "source": "Metacritic",
        "value": "69/100"
      }
    ]
  },
  {
    "title": "Bohemian Rhapsody",
    "year": "2018",
    "released": "02 Nov 2018",
    "runtime": "134 min",
    "genre": "Biography, Drama, Music",
    "director": "Bryan Singer",
    "actors": "Rami Malek, Lucy Boynton, Gwilym Lee, Ben Hardy",
    "plot": "The story of the legendary rock band Queen and lead singer Freddie Mercury, leading up to their famous performance at Live Aid (1985).",
    "language": "English",
    "country": "UK, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.1/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "61%"
      },
      {
        "source": "Metacritic",
        "value": "49/100"
      }
    ]
  },
  {
    "title": "Doctor Strange",
    "year": "2016",
    "released": "04 Nov 2016",
    "runtime": "115 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "Scott Derrickson",
    "actors": "Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong",
    "plot": "Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "89%"
      },
      {
        "source": "Metacritic",
        "value": "72/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode IV - A New Hope",
    "year": "1977",
    "released": "25 May 1977",
    "runtime": "121 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "George Lucas",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing",
    "plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.6/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "93%"
      },
      {
        "source": "Metacritic",
        "value": "90/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode V - The Empire Strikes Back",
    "year": "1980",
    "released": "20 Jun 1980",
    "runtime": "124 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "Irvin Kershner",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams",
    "plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.8/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "95%"
      },
      {
        "source": "Metacritic",
        "value": "82/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode VI - Return of the Jedi",
    "year": "1983",
    "released": "25 May 1983",
    "runtime": "131 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "Richard Marquand",
    "actors": "Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams",
    "plot": "Luke Skywalker battles horrible Jabba the Hut and cruel Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love and team with Chewbacca, Lando Calrissian, the Ewoks and the androids C-3PO and R2-D2 to aid in the disruption of the Dark Side and the defeat of the evil emperor.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.3/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "81%"
      },
      {
        "source": "Metacritic",
        "value": "58/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode VII - The Force Awakens",
    "year": "2015",
    "released": "18 Dec 2015",
    "runtime": "136 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "J.J. Abrams",
    "actors": "Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver",
    "plot": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.0/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "92%"
      },
      {
        "source": "Metacritic",
        "value": "81/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode I - The Phantom Menace",
    "year": "1999",
    "released": "19 May 1999",
    "runtime": "136 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "George Lucas",
    "actors": "Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd",
    "plot": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "54%"
      },
      {
        "source": "Metacritic",
        "value": "51/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode I - The Phantom Menace",
    "year": "1999",
    "released": "19 May 1999",
    "runtime": "136 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "George Lucas",
    "actors": "Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd",
    "plot": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.5/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "54%"
      },
      {
        "source": "Metacritic",
        "value": "51/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode II - Attack of the Clones",
    "year": "2002",
    "released": "16 May 2002",
    "runtime": "142 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "George Lucas",
    "actors": "Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee",
    "plot": "Ten years after the invasion of Naboo, the Galactic Republic is facing a Separatist movement and the former queen and now Senator Padmé Amidala travels to Coruscant to vote on a project to create an army to help the Jedi to protect the Republic. Upon arrival, she escapes from an attempt to kill her, and Obi-Wan Kenobi and his Padawan Anakin Skywalker are assigned to protect her. They chase the shape-shifter Zam Wessell but she is killed by a poisoned dart before revealing who hired her. The Jedi Council assigns Obi-Wan Kenobi to discover who has tried to kill Amidala and Anakin to protect her in Naboo. Obi-Wan discovers that the dart is from the planet Kamino, and he heads to the remote planet. He finds an army of clones that has been under production for years for the Republic and that the bounty hunter Jango Fett was the matrix for the clones. Meanwhile Anakin and Amidala fall in love with each other, and he has nightmarish visions of his mother. They travel to his home planet, Tatooine, to see his mother, and he discovers that she has been abducted by Tusken Raiders. Anakin finds his mother dying, and he kills all the Tusken tribe, including the women and children. Obi-Wan follows Jango Fett to the planet Geonosis where he discovers who is behind the Separatist movement. He transmits his discoveries to Anakin since he cannot reach the Jedi Council. Who is the leader of the Separatist movement? Will Anakin receive Obi-Wan's message? And will the secret love between Anakin and Amidala succeed?",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.6/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "65%"
      },
      {
        "source": "Metacritic",
        "value": "54/100"
      }
    ]
  },
  {
    "title": "Star Wars: Episode VIII - The Last Jedi",
    "year": "2017",
    "released": "15 Dec 2017",
    "runtime": "152 min",
    "genre": "Action, Adventure, Fantasy, Sci-Fi",
    "director": "Rian Johnson",
    "actors": "Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley",
    "plot": "Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares for battle with the First Order.",
    "language": "English",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.2/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "91%"
      },
      {
        "source": "Metacritic",
        "value": "85/100"
      }
    ]
  },
  {
    "title": "Midnight in Paris",
    "year": "2011",
    "released": "10 Jun 2011",
    "runtime": "94 min",
    "genre": "Comedy, Fantasy, Romance",
    "director": "Woody Allen",
    "actors": "Owen Wilson, Rachel McAdams, Kurt Fuller, Mimi Kennedy",
    "plot": "Gil and Inez travel to Paris as a tag-along vacation on her parents' business trip. Gil is a successful Hollywood writer but is struggling on his first novel. He falls in love with the city and thinks they should move there after they get married, but Inez does not share his romantic notions of the city or the idea that the 1920s was the golden age. When Inez goes off dancing with her friends, Gil takes a walk at midnight and discovers what could be the ultimate source of inspiration for writing. Gil's daily walks at midnight in Paris could take him closer to the heart of the city but further from the woman he's about to marry.",
    "language": "English, French, Spanish, German",
    "country": "Spain, USA, France",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.7/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "93%"
      },
      {
        "source": "Metacritic",
        "value": "81/100"
      }
    ]
  },
  {
    "title": "Annie Hall",
    "year": "1977",
    "released": "20 Apr 1977",
    "runtime": "93 min",
    "genre": "Comedy, Romance",
    "director": "Woody Allen",
    "actors": "Woody Allen, Diane Keaton, Tony Roberts, Carol Kane",
    "plot": "Alvy Singer, a forty year old twice divorced, neurotic, intellectual Jewish New York stand-up comic, reflects on the demise of his latest relationship, to Annie Hall, an insecure, flighty, Midwestern WASP aspiring nightclub singer. Unlike his previous relationships, Alvy believed he may have worked out all the issues in his life through fifteen years of therapy to make this relationship with Annie last, among those issues being not wanting to date any woman that would want to date him, and thus subconsciously pushing those women away. Alvy not only reviews the many ups and many downs of their relationship, but also reviews the many facets of his makeup that led to him starting to date Annie. Those facets include growing up next to Coney Island in Brooklyn, being attracted to the opposite sex for as long as he can remember, and enduring years of Jewish guilt with his constantly arguing parents.",
    "language": "English, German",
    "country": "USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "8.0/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "97%"
      },
      {
        "source": "Metacritic",
        "value": "92/100"
      }
    ]
  },
  {
    "title": "Magic in the Moonlight",
    "year": "2014",
    "released": "15 Aug 2014",
    "runtime": "97 min",
    "genre": "Comedy, Romance",
    "director": "Woody Allen",
    "actors": "Colin Firth, Antonia Clarke, Natasha Andrews, Valérie Beaulieu",
    "plot": "Stanley is a magician who has dedicated his life to revealing fraudulent spiritualists. He plans to quickly uncover the truth behind celebrated spiritualist Sophie and her scheming mother. However, the more time he spends with her, he starts thinking that she might actually be able to communicate with the other world, but even worse, he might be falling in love with her.",
    "language": "English, French",
    "country": "USA, France",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.6/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "51%"
      },
      {
        "source": "Metacritic",
        "value": "54/100"
      }
    ]
  },
  {
    "title": "Magic in the Moonlight",
    "year": "2014",
    "released": "15 Aug 2014",
    "runtime": "97 min",
    "genre": "Comedy, Romance",
    "director": "Woody Allen",
    "actors": "Colin Firth, Antonia Clarke, Natasha Andrews, Valérie Beaulieu",
    "plot": "Stanley is a magician who has dedicated his life to revealing fraudulent spiritualists. He plans to quickly uncover the truth behind celebrated spiritualist Sophie and her scheming mother. However, the more time he spends with her, he starts thinking that she might actually be able to communicate with the other world, but even worse, he might be falling in love with her.",
    "language": "English, French",
    "country": "USA, France",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "6.6/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "51%"
      },
      {
        "source": "Metacritic",
        "value": "54/100"
      }
    ]
  },
  {
    "title": "Vicky Cristina Barcelona",
    "year": "2008",
    "released": "15 Aug 2008",
    "runtime": "96 min",
    "genre": "Drama, Romance",
    "director": "Woody Allen",
    "actors": "Rebecca Hall, Scarlett Johansson, Christopher Evan Welch, Chris Messina",
    "plot": "Sexually adventurous Cristina and her friend Vicky, who is bright but cautious, holiday in Barcelona where they meet the celebrated and wholly seductive painter, Juan Antonio. Vicky is not about to dive into a sexual adventure being committed to her forthcoming marriage. But Cristina is immediately captivated by Juan Antonio's free spirit and his romantic allure is enhanced when she hears the delicious details of his divorce from fellow artist, the tempestuous Maria Elena.",
    "language": "English, Spanish",
    "country": "Spain, USA",
    "ratings": [
      {
        "source": "Internet Movie Database",
        "value": "7.1/10"
      },
      {
        "source": "Rotten Tomatoes",
        "value": "81%"
      },
      {
        "source": "Metacritic",
        "value": "70/100"
      }
    ]
  }
]